{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles and CRUD project storage with design elements.",
  "feature_evidence.json": "Feature‑evidence report mapping features to related frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing human‑written summaries of all major frontend source files.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "HTML entry point mounting the React root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and theme provider for the main app.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users for their name and saving the profile via backend hooks.",
  "frontend/src/components/designer/BaseColorPicker.tsx": "Popover color picker for selecting garment base color with presets and custom input.",
  "frontend/src/components/designer/DesignCanvas2D.tsx": "Renders a garment design canvas, draws elements with transformations, and manages selection and drag interactions.",
  "frontend/src/components/designer/ExportDesignButton.tsx": "Exports the current garment design to PNG using a template and shows success or error toasts.",
  "frontend/src/components/designer/GarmentSelector.tsx": "Dropdown selector allowing users to choose the garment type.",
  "frontend/src/components/designer/LayersPanel.tsx": "Displays design elements as layers and allows selecting and reordering them.",
  "frontend/src/components/designer/OnboardingTips.tsx": "Shows dismissible onboarding tips stored in client persistence.",
  "frontend/src/components/designer/SelectionToolbar.tsx": "Provides controls for duplicating, deleting, resizing, and rotating the selected design element.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout with header navigation, footer, and routed content outlet.",
  "frontend/src/components/logo-maker/LogoCanvas2D.tsx": "Renders a transparent-background logo canvas with text and shape elements.",
  "frontend/src/components/logo-maker/LogoControlsPanel.tsx": "UI panel to add text, shapes, or uploaded images to the logo maker.",
  "frontend/src/components/logo-maker/LogoExportButton.tsx": "Exports the composed logo as PNG or adds it to the main design.",
  "frontend/src/components/projects/NewProjectDialog.tsx": "Modal form for creating a project with name, garment type, and base color, calling createProject and navigating to the designer.",
  "frontend/src/components/projects/ProjectList.tsx": "Displays a grid of user projects with open and delete actions, including confirmation dialogs and date formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and update the caller's user profile through the backend actor with react-query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and AuthClient setup and state management.",
  "frontend/src/hooks/useProjects.ts": "React-query hooks for CRUD operations on projects, using the actor and invalidating related caches.",
  "frontend/src/index.css": "Tailwind setup defining CSS variables for themes, colors, and base styling.",
  "frontend/src/main.tsx": "Entry point initializing React root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/DesignerPage.tsx": "Designer workspace page that loads a project into state, allows editing, and saves updates using updateProject.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, navigation buttons, and feature cards for the design tools.",
  "frontend/src/pages/LogoMakerPage.tsx": "Logo creation page with canvas, controls, export button, and option to add logos to designer state.",
  "frontend/src/pages/ProjectGalleryPage.tsx": "Displays authenticated user's project list with loading state and new project dialog.",
  "frontend/src/state/designerTypes.ts": "Defines garment types, design element structure, and overall designer state model.",
  "frontend/src/state/projectSerialization.ts": "Converts backend project data into a partial DesignerState with mapped element properties.",
  "frontend/src/state/useDesignerState.ts": "Zustand store managing garment settings, design elements, selection, ordering, and state loading.",
  "frontend/src/utils/clientPersistence.ts": "Utility for safe localStorage get/set with error handling.",
  "frontend/src/utils/exportDesignPng.ts": "Generates a PNG of the design by drawing the garment template and elements onto a canvas and downloading it.",
  "frontend/src/utils/garmentTemplates.ts": "Provides garment template metadata and a helper to retrieve templates by type.",
  "frontend/src/utils/imageImport.ts": "Validates uploaded images and returns their data URL via FileReader.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with theme extensions, plugins, and custom color system.",
  "project_state.json": "Defines current project state, existing features, and required garment images for a clothing design web app."
}